week_4/quiz_4.tex
% Created 2024-07-01 Mon 07:21
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper,left=1cm,right=1cm,top=1cm,bottom=1cm]{geometry}
\usepackage[american, english]{babel}
\usepackage{enumitem}
\usepackage{float}
\usepackage[sc]{mathpazo}
\linespread{1.05}
\renewcommand{\labelitemi}{$\rhd$}
\setlength\parindent{0pt}
\setlist[itemize]{leftmargin=*}
\setlist{nosep}
\date{}
\title{Week 4 Quiz}
\hypersetup{
 pdfauthor={Marcio Woitek},
 pdftitle={Week 4 Quiz},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.8)}, 
 pdflang={English}}
\begin{document}

\thispagestyle{empty}
\pagestyle{empty}
\section*{Problem 1}
\label{sec:orgd936b79}

\textbf{Answer:} Sample size should be at least 30 and the population distribution
should not be extremely skewed.
\section*{Problem 2}
\label{sec:org90b01e0}

\textbf{Answer:} False
\section*{Problem 3}
\label{sec:orgf6a41ed}

\textbf{Answer:} \(H_0:p=0.5\); \(H_A:p>0.5\)
\section*{Problem 4}
\label{sec:orgf5bbe4e}

\textbf{Answer:}
\begin{itemize}
\item Version 1: If in fact 10\% of the birds in the aviary are cardinals, the
probability of obtaining a random sample of 250 birds where exactly 14\% are
cardinals is 0.0175.
\item Version 2: If in fact 50\% of likely voters support this candidate, the
probability of obtaining a random sample of 500 likely voters where 52\% or
more support the candidate is 0.19.
\end{itemize}
\section*{Problem 5}
\label{sec:org04827ca}

\textbf{Answer:} 0.022

\begin{verbatim}
y1 <- 493
n1 <- 1037

y2 <- 596
n2 <- 1028

p_hat <- (y1 + y2) / (n1 + n2)
std_err <- sqrt(p_hat * (1 - p_hat) * (1 / n1 + 1 / n2))
signif(std_err, digits = 3)
\end{verbatim}

\phantomsection
\label{}
\begin{verbatim}
[1] 0.022
\end{verbatim}
\section*{Problem 6}
\label{sec:org3a83d68}

\textbf{Answer:} Because in hypothesis testing, we assume the null hypothesis is true,
hence we calculate SE using the null value of the parameter. In confidence
intervals, there is no null value, hence we use the sample proportion(s).
\section*{Problem 7}
\label{sec:orga38473e}

\textbf{Answer:}
\begin{itemize}
\item Version 1: \(\chi^2\) test of goodness of fit
\item Version 2: Chi-square test of independence [This version has a table.]
\end{itemize}
\section*{Problem 8}
\label{sec:org2c94082}

\textbf{Answer:}
\begin{itemize}
\item Version 1: Roll a 10-sided die 100 times and record the proportion of times
you get a 6 or lower. Repeat this many times, and calculate the number of
simulations where the sample proportion is 56\% or less.
\item Version 2: Roll a 10-sided die 40 times and record the proportion of times you
get a 1. Repeat this many times, and calculate the proportion of simulations
where the sample proportion is 15\% or more.
\end{itemize}
\section*{Problem 9}
\label{sec:org537972e}

\textbf{Answer:} True
\section*{Problem 10}
\label{sec:orgb81724b}

\textbf{Answer:}
\begin{itemize}
\item Version 1: False
\item Version 2: Right-skewed
\end{itemize}
\section*{Problem 11}
\label{sec:orgb24b9f7}

\textbf{Answer:} 3.36

\begin{verbatim}
col1 <- c(6, 16, 4)
col2 <- c(6, 15, 3)
tbl <- array(c(col1, col2), dim = c(3, 2))

table_total <- sum(tbl)
row_total <- apply(tbl, c(1), sum)[3]
column_total <- apply(tbl, c(2), sum)[2]

exp_male <- row_total * column_total / table_total
signif(exp_male, digits = 3)
\end{verbatim}

\phantomsection
\label{}
\begin{verbatim}
[1] 3.36
\end{verbatim}
\section*{Problem 12}
\label{sec:orgf8e1684}

\textbf{Answer:} True
\end{document}
